package Practice4.oseminar;

public class HomeWork6 {

    /**
     * Взять реализованный код в рамках семинара 4 и продемонстрировать применение принципов, усвоенных на семинаре.
     * Нужно в проекте прокомментировать участки кода, которые рефакторим, какой принцип применяем и почему
     *
     * Принципы SOLID:
     *    1 - Принцип единой ответственности (Один класс - одна задача/ответственность)
     *    2 - Принцип закрытости/открытости (Объекты программирования должны быть открыты для расширения, но закрыты для модификации)
     *    3 - Принцип заменяемости (Имеется возможность использовать любой производный класс вместо родительского без изменений)
     *    4 - Принцип разделения интерфейсов (Слишком толстые интерфейсы необходимо разделять на более мелкие, чтобы клиенты маленьких
     *        интерфейсов знали только о методах, которые необходимы им в работе)
     *    5 - Принцип инверсии зависимости (Все зависимости в программе должны поддерживаться с помощью абстрактных классов или интерфейсов)
     */

    public static void main(String[] args) {

    }
}
